# ScaleBasisAndOrigin Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..ScaleBasisAndOrigin Method
Transform Class See Also
---
Scales the basis vectors and the origin of this transformation and returns the result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Transform ScaleBasisAndOrigin(
	double scale
)
```

Visual Basic
---
```text
Public Function ScaleBasisAndOrigin ( _
	scale As Double _
) As Transform
```

Visual C++
---
```text
public:
Transform^ ScaleBasisAndOrigin(
	double scale
)
```

# ### Parameters
scale
    Type: System..::..DoubleThe scale value.
# ### Return Value
The transformation equal to the composition of the two transformations.
# Remarks
The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the specified value is an infinite number. |

# See Also
Transform Class
Autodesk.Revit.DB Namespace